Revit 2027 API
PipeScheduleType.GetPipeScheduleId Method
 Returns an existing pipe schedule type with the same name.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ElementId GetPipeScheduleId(
	Document doc,
	string name
)
Public Shared Function GetPipeScheduleId (
	doc As Document,
	name As String
) As ElementId
public:
static ElementId^ GetPipeScheduleId(
	Document^ doc,
	String^ name
)
static member GetPipeScheduleId :
        doc : Document *
        name : string -> ElementId
Parameters
doc Document
 The document
name String
 The name of requested schedule type.
Return Value
ElementId
 Returns the element id of request schedule type, or invalidElementId if the name is not found.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
PipeScheduleType Class
Autodesk.Revit.DB.Plumbing Namespace